# GetKnotsV Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
NurbsSurfaceData..::..GetKnotsV Method
NurbsSurfaceData Class See Also
---
Get the list of knots in the v-direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<double> GetKnotsV()
```

Visual Basic
---
```text
Public Function GetKnotsV As IList(Of Double)
```

Visual C++
---
```text
public:
IList<double>^ GetKnotsV()
```

# See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace